// Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.

int a = 322;

if (a % 7 == 0 & a % 23 == 0)
{
    System.Console.WriteLine("да");
}
else
{
    System.Console.WriteLine("нет");
}